__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_score_48 (InputLayer)     (None, 128, 384, 2)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 384, 32) 3168        input_score_48[0][0]             
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 128, 384, 32) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 384, 32) 128         activation_1[0][0]               
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128, 384, 32) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 64, 192, 32)  9248        dropout_1[0][0]                  
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 64, 192, 32)  0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 64, 192, 32)  128         activation_2[0][0]               
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 64, 192, 32)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 192, 32)  9248        dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 192, 32)  1056        conv2d_1[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64, 192, 32)  0           conv2d_3[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64, 192, 32)  0           add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 64, 192, 32)  128         activation_3[0][0]               
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 64, 192, 32)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 192, 32)  9248        dropout_3[0][0]                  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 64, 192, 32)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 64, 192, 32)  128         activation_4[0][0]               
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 64, 192, 32)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 192, 32)  9248        dropout_4[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 64, 192, 32)  0           conv2d_6[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 192, 32)  0           add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64, 192, 32)  128         activation_5[0][0]               
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 64, 192, 32)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 96, 64)   18496       dropout_5[0][0]                  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 96, 64)   0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 96, 64)   256         activation_6[0][0]               
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 32, 96, 64)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 96, 64)   36928       dropout_6[0][0]                  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 96, 64)   2112        add_2[0][0]                      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 96, 64)   0           conv2d_8[0][0]                   
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 96, 64)   0           add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 96, 64)   256         activation_7[0][0]               
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 32, 96, 64)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 96, 64)   36928       dropout_7[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 96, 64)   0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 32, 96, 64)   256         activation_8[0][0]               
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 32, 96, 64)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 96, 64)   36928       dropout_8[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 96, 64)   0           conv2d_11[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 32, 96, 64)   0           add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 96, 64)   256         activation_9[0][0]               
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 32, 96, 64)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 32, 96, 64)   36928       dropout_9[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 32, 96, 64)   0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 96, 64)   256         activation_10[0][0]              
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 32, 96, 64)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 96, 64)   36928       dropout_10[0][0]                 
__________________________________________________________________________________________________
add_5 (Add)                     (None, 32, 96, 64)   0           conv2d_13[0][0]                  
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 32, 96, 64)   0           add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 32, 96, 64)   256         activation_11[0][0]              
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 32, 96, 64)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 16, 48, 128)  73856       dropout_11[0][0]                 
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 48, 128)  0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 48, 128)  512         activation_12[0][0]              
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 16, 48, 128)  147584      dropout_12[0][0]                 
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 16, 48, 128)  8320        add_5[0][0]                      
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 48, 128)  0           conv2d_15[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 48, 128)  0           add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 48, 128)  512         activation_13[0][0]              
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 16, 48, 128)  147584      dropout_13[0][0]                 
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 16, 48, 128)  0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 48, 128)  512         activation_14[0][0]              
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 16, 48, 128)  147584      dropout_14[0][0]                 
__________________________________________________________________________________________________
add_7 (Add)                     (None, 16, 48, 128)  0           conv2d_18[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 16, 48, 128)  0           add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 16, 48, 128)  512         activation_15[0][0]              
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 16, 48, 128)  147584      dropout_15[0][0]                 
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 16, 48, 128)  0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 16, 48, 128)  512         activation_16[0][0]              
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 16, 48, 128)  147584      dropout_16[0][0]                 
__________________________________________________________________________________________________
add_8 (Add)                     (None, 16, 48, 128)  0           conv2d_20[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 16, 48, 128)  0           add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 16, 48, 128)  512         activation_17[0][0]              
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 16, 48, 128)  147584      dropout_17[0][0]                 
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 16, 48, 128)  0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 16, 48, 128)  512         activation_18[0][0]              
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 16, 48, 128)  147584      dropout_18[0][0]                 
__________________________________________________________________________________________________
add_9 (Add)                     (None, 16, 48, 128)  0           conv2d_22[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 16, 48, 128)  0           add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 16, 48, 128)  512         activation_19[0][0]              
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 8, 24, 256)   295168      dropout_19[0][0]                 
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 8, 24, 256)   0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 8, 24, 256)   1024        activation_20[0][0]              
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 8, 24, 256)   590080      dropout_20[0][0]                 
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 8, 24, 256)   33024       add_9[0][0]                      
__________________________________________________________________________________________________
add_10 (Add)                    (None, 8, 24, 256)   0           conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 8, 24, 256)   0           add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 8, 24, 256)   1024        activation_21[0][0]              
__________________________________________________________________________________________________
dropout_21 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 8, 24, 256)   590080      dropout_21[0][0]                 
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 8, 24, 256)   0           conv2d_26[0][0]                  
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 8, 24, 256)   1024        activation_22[0][0]              
__________________________________________________________________________________________________
dropout_22 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 8, 24, 256)   590080      dropout_22[0][0]                 
__________________________________________________________________________________________________
add_11 (Add)                    (None, 8, 24, 256)   0           conv2d_27[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 8, 24, 256)   0           add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 8, 24, 256)   1024        activation_23[0][0]              
__________________________________________________________________________________________________
dropout_23 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 8, 24, 256)   590080      dropout_23[0][0]                 
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 8, 24, 256)   0           conv2d_28[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 8, 24, 256)   1024        activation_24[0][0]              
__________________________________________________________________________________________________
dropout_24 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 8, 24, 256)   590080      dropout_24[0][0]                 
__________________________________________________________________________________________________
add_12 (Add)                    (None, 8, 24, 256)   0           conv2d_29[0][0]                  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 8, 24, 256)   0           add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 8, 24, 256)   1024        activation_25[0][0]              
__________________________________________________________________________________________________
dropout_25 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 8, 24, 256)   590080      dropout_25[0][0]                 
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 8, 24, 256)   0           conv2d_30[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 8, 24, 256)   1024        activation_26[0][0]              
__________________________________________________________________________________________________
dropout_26 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 8, 24, 256)   590080      dropout_26[0][0]                 
__________________________________________________________________________________________________
add_13 (Add)                    (None, 8, 24, 256)   0           conv2d_31[0][0]                  
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 8, 24, 256)   0           add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 8, 24, 256)   1024        activation_27[0][0]              
__________________________________________________________________________________________________
dropout_27 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 8, 24, 256)   590080      dropout_27[0][0]                 
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 8, 24, 256)   0           conv2d_32[0][0]                  
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 8, 24, 256)   1024        activation_28[0][0]              
__________________________________________________________________________________________________
dropout_28 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 8, 24, 256)   590080      dropout_28[0][0]                 
__________________________________________________________________________________________________
add_14 (Add)                    (None, 8, 24, 256)   0           conv2d_33[0][0]                  
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 8, 24, 256)   0           add_14[0][0]                     
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 8, 24, 256)   1024        activation_29[0][0]              
__________________________________________________________________________________________________
dropout_29 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 8, 24, 512)   131584      dropout_29[0][0]                 
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 8, 24, 512)   1180160     dropout_29[0][0]                 
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 8, 24, 512)   2048        conv2d_34[0][0]                  
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 8, 24, 512)   2048        conv2d_35[0][0]                  
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 8, 24, 512)   1180160     dropout_29[0][0]                 
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 8, 24, 1024)  0           batch_normalization_30[0][0]     
                                                                 batch_normalization_31[0][0]     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 8, 24, 512)   2048        conv2d_36[0][0]                  
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 8, 24, 512)   1180160     dropout_29[0][0]                 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 8, 24, 1536)  0           concatenate_1[0][0]              
                                                                 batch_normalization_32[0][0]     
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 8, 24, 512)   2048        conv2d_37[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 8, 24, 2048)  0           concatenate_2[0][0]              
                                                                 batch_normalization_33[0][0]     
__________________________________________________________________________________________________
dropout_30 (Dropout)            (None, 8, 24, 2048)  0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 8, 24, 512)   1049088     dropout_30[0][0]                 
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 8, 24, 512)   0           conv2d_38[0][0]                  
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 8, 24, 512)   2048        activation_30[0][0]              
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 8, 24, 256)   131328      batch_normalization_34[0][0]     
__________________________________________________________________________________________________
add_15 (Add)                    (None, 8, 24, 256)   0           conv2d_39[0][0]                  
                                                                 add_14[0][0]                     
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 8, 24, 256)   0           add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 8, 24, 256)   1024        activation_31[0][0]              
__________________________________________________________________________________________________
dropout_31 (Dropout)            (None, 8, 24, 256)   0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 8, 24, 128)   295040      dropout_31[0][0]                 
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 8, 24, 128)   0           conv2d_40[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 8, 24, 128)   512         activation_32[0][0]              
__________________________________________________________________________________________________
dropout_32 (Dropout)            (None, 8, 24, 128)   0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 16, 48, 128)  147584      dropout_32[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 16, 48, 128)  32896       add_15[0][0]                     
__________________________________________________________________________________________________
add_16 (Add)                    (None, 16, 48, 128)  0           conv2d_transpose_1[0][0]         
                                                                 conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 16, 48, 128)  0           add_16[0][0]                     
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 16, 48, 128)  0           add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 16, 48, 128)  512         activation_33[0][0]              
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 16, 48, 128)  512         activation_34[0][0]              
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 16, 48, 256)  0           batch_normalization_37[0][0]     
                                                                 batch_normalization_38[0][0]     
__________________________________________________________________________________________________
dropout_33 (Dropout)            (None, 16, 48, 256)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 16, 48, 128)  32896       dropout_33[0][0]                 
__________________________________________________________________________________________________
add_17 (Add)                    (None, 16, 48, 128)  0           conv2d_41[0][0]                  
                                                                 add_16[0][0]                     
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 16, 48, 128)  0           add_17[0][0]                     
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 16, 48, 128)  512         activation_35[0][0]              
__________________________________________________________________________________________________
dropout_34 (Dropout)            (None, 16, 48, 128)  0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 16, 48, 64)   73792       dropout_34[0][0]                 
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 16, 48, 64)   0           conv2d_42[0][0]                  
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 16, 48, 64)   256         activation_36[0][0]              
__________________________________________________________________________________________________
dropout_35 (Dropout)            (None, 16, 48, 64)   0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 32, 96, 64)   36928       dropout_35[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 32, 96, 64)   8256        add_17[0][0]                     
__________________________________________________________________________________________________
add_18 (Add)                    (None, 32, 96, 64)   0           conv2d_transpose_3[0][0]         
                                                                 conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 32, 96, 64)   0           add_18[0][0]                     
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 32, 96, 64)   0           add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 32, 96, 64)   256         activation_37[0][0]              
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 32, 96, 64)   256         activation_38[0][0]              
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 32, 96, 128)  0           batch_normalization_41[0][0]     
                                                                 batch_normalization_42[0][0]     
__________________________________________________________________________________________________
dropout_36 (Dropout)            (None, 32, 96, 128)  0           concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 32, 96, 64)   8256        dropout_36[0][0]                 
__________________________________________________________________________________________________
add_19 (Add)                    (None, 32, 96, 64)   0           conv2d_43[0][0]                  
                                                                 add_18[0][0]                     
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 32, 96, 64)   0           add_19[0][0]                     
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 32, 96, 64)   256         activation_39[0][0]              
__________________________________________________________________________________________________
dropout_37 (Dropout)            (None, 32, 96, 64)   0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 32, 96, 32)   18464       dropout_37[0][0]                 
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 32, 96, 32)   0           conv2d_44[0][0]                  
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 32, 96, 32)   128         activation_40[0][0]              
__________________________________________________________________________________________________
dropout_38 (Dropout)            (None, 32, 96, 32)   0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 64, 192, 32)  9248        dropout_38[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 64, 192, 32)  2080        add_19[0][0]                     
__________________________________________________________________________________________________
add_20 (Add)                    (None, 64, 192, 32)  0           conv2d_transpose_5[0][0]         
                                                                 conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 64, 192, 32)  0           add_20[0][0]                     
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 64, 192, 32)  0           add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 64, 192, 32)  128         activation_41[0][0]              
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 64, 192, 32)  128         activation_42[0][0]              
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 64, 192, 64)  0           batch_normalization_45[0][0]     
                                                                 batch_normalization_46[0][0]     
__________________________________________________________________________________________________
dropout_39 (Dropout)            (None, 64, 192, 64)  0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 64, 192, 32)  2080        dropout_39[0][0]                 
__________________________________________________________________________________________________
add_21 (Add)                    (None, 64, 192, 32)  0           conv2d_45[0][0]                  
                                                                 add_20[0][0]                     
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 64, 192, 32)  0           add_21[0][0]                     
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 64, 192, 32)  128         activation_43[0][0]              
__________________________________________________________________________________________________
dropout_40 (Dropout)            (None, 64, 192, 32)  0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 64, 192, 32)  9248        dropout_40[0][0]                 
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 64, 192, 32)  0           conv2d_46[0][0]                  
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 64, 192, 32)  128         activation_44[0][0]              
__________________________________________________________________________________________________
dropout_41 (Dropout)            (None, 64, 192, 32)  0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 128, 384, 32) 9248        dropout_41[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 128, 384, 32) 1056        add_21[0][0]                     
__________________________________________________________________________________________________
add_22 (Add)                    (None, 128, 384, 32) 0           conv2d_transpose_7[0][0]         
                                                                 conv2d_transpose_8[0][0]         
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 128, 384, 32) 0           add_22[0][0]                     
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, 128, 384, 32) 128         activation_45[0][0]              
__________________________________________________________________________________________________
dropout_42 (Dropout)            (None, 128, 384, 32) 0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
prediction (Conv2D)             (None, 128, 384, 3)  99          dropout_42[0][0]                 
==================================================================================================
Total params: 12,571,907
Trainable params: 12,556,099
Non-trainable params: 15,808
__________________________________________________________________________________________________
